# Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список. Тобто, в результаті повинен вийти список із 2-х списків.
# Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.
# Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
# Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість елементів і в списку непарна кількість елементів.
#Artem Guguyev

#list_main = [1, 2, 3, 4, 5, 6] #=> [[1, 2, 3], [4, 5, 6]]
#list_main = [1, 2, 3] #=> [[1, 2], [3]]
#list_main = [1, 2, 3, 4, 5] #=> [[1, 2, 3], [4, 5]]
#list_main = [1] #=> [[1], []]
list_main = [] #=> [[], []]

#x = round(((len(list_main) / 2) + 0.1))
x = int(len(list_main) / 2) + ((len(list_main) / 2) % 1 > 0)
list_1 = list_main[:x]
list_2 = list_main[x:]
list_final = []
list_final.insert(0,list_1)
list_final.insert(1,list_2)
print(list_final)