# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
# Ну і додатковим завданням є турбота про виведення.
# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек. Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
# Доповнити провідними нулями можна за допомогою методу zfill(2)
# Artem Guguyev

print('Програма працює з невід\'ємними числами до 8640000')
usr_time = int(input('Введіть кількість секунд - '))
if usr_time < 8640000:
    usr_time, s = divmod(usr_time, 60)
    usr_time, h = divmod(usr_time, 60)
    d, g = divmod(usr_time, 24)
    if 10 < d < 20:
        den = 'днів'
    elif d % 10 == 1:
        den = 'день'
    elif d % 10 in [2, 3, 4] :
        den = 'дні'
    else:
        den = 'днів'
    # s = str(s).zfill(2)
    # h = str(h).zfill(2)
    # g = str(g).zfill(2)
    # print(f'{d} {den}, {g}:{h}:{s}')
    t = [str(el).zfill(2) for el in [g, h, s]]
    print(f'{d} {den}, {t[0]}:{t[1]}:{t[2]}')
else:
    print('Це точно більше за 8640000')

# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

