
# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!
#Artem Guguyev

list_1 = [0, 1, 0, 12, 3] #-> [1, 12, 3, 0, 0]
#list_1 = [0] #-> [0]
#list_1 = [1, 0, 13, 0, 0, 0, 5] #-> [1, 13, 5, 0, 0, 0, 0]
#list_1 = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] #-> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

for i, el in enumerate(list_1):
    if el == 0:
        list_1.remove(el)
        list_1.append(0)
print(list_1)


# for i in range(len(list_1)):
#     if list_1[i] == 0:
#         list_1.remove(list_1[i])
#         list_1.append(0)
# print(list_1)